tiborsimon/embedded-tdd-headers/pic/8bit/pic18f44k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F44K22_H_
#define _PIC18F44K22_H_

#define ANSELA                        0
#define ANSA0                         1
#define ANSA1                         2
#define ANSA2                         3
#define ANSA3                         4
#define ANSA5                         5
#define ANSELB                        6
#define ANSB0                         7
#define ANSB1                         8
#define ANSB2                         9
#define ANSB3                         10
#define ANSB4                         11
#define ANSB5                         12
#define ANSELC                        13
#define ANSC2                         14
#define ANSC3                         15
#define ANSC4                         16
#define ANSC5                         17
#define ANSC6                         18
#define ANSC7                         19
#define ANSELD                        20
#define ANSD0                         21
#define ANSD1                         22
#define ANSD2                         23
#define ANSD3                         24
#define ANSD4                         25
#define ANSD5                         26
#define ANSD6                         27
#define ANSD7                         28
#define ANSELE                        29
#define ANSE0                         30
#define ANSE1                         31
#define ANSE2                         32
#define PMD2                          33
#define ADCMD                         34
#define CMP1MD                        35
#define CMP2MD                        36
#define CTMUMD                        37
#define PMD1                          38
#define EMBMD                         39
#define CCP1MD                        40
#define CCP2MD                        41
#define CCP3MD                        42
#define CCP4MD                        43
#define CCP5MD                        44
#define MSSP1MD                       45
#define MSSP2MD                       46
#define PMD0                          47
#define TMR1MD                        48
#define SPI1MD                        49
#define TMR2MD                        50
#define SPI2MD                        51
#define TMR3MD                        52
#define TMR4MD                        53
#define TMR5MD                        54
#define TMR6MD                        55
#define UART1MD                       56
#define UART2MD                       57
#define VREFCON2                      58
#define DACR0                         59
#define DACR                          60
#define DACR1                         61
#define DACR2                         62
#define DACR3                         63
#define DACR4                         64
#define VREFCON1                      65
#define DACNSS                        66
#define DACPSS                        67
#define DACPSS0                       68
#define DACPSS1                       69
#define DACOE                         70
#define DACLPS                        71
#define DACEN                         72
#define VREFCON0                      73
#define FVRS                          74
#define FVRS0                         75
#define FVRS1                         76
#define FVRST                         77
#define FVREN                         78
#define CTMUICON                      79
#define IRNG                          80
#define IRNG0                         81
#define IRNG1                         82
#define ITRIM0                        83
#define ITRIM                         84
#define ITRIM1                        85
#define ITRIM2                        86
#define ITRIM3                        87
#define ITRIM4                        88
#define ITRIM5                        89
#define CTMUCONL                      90
#define EDG1STAT                      91
#define EDG2STAT                      92
#define EDG1SEL                       93
#define EDG1SEL0                      94
#define EDG1SEL1                      95
#define EDG1POL                       96
#define EDG2SEL0                      97
#define EDG2SEL                       98
#define EDG2SEL1                      99
#define EDG2POL                       100
#define CTMUCONH                      101
#define CTTRIG                        102
#define IDISSEN                       103
#define EDGSEQEN                      104
#define EDGEN                         105
#define TGEN                          106
#define CTMUSIDL                      107
#define CTMUEN                        108
#define SRCON1                        109
#define SRRC1E                        110
#define SRRC2E                        111
#define SRRCKE                        112
#define SRRPE                         113
#define SRSC1E                        114
#define SRSC2E                        115
#define SRSCKE                        116
#define SRSPE                         117
#define SRCON0                        118
#define SRPR                          119
#define SRPS                          120
#define SRNQEN                        121
#define SRQEN                         122
#define SRCLK0                        123
#define SRCLK                         124
#define SRCLK1                        125
#define SRCLK2                        126
#define SRLEN                         127
#define CCPTMRS1                      128
#define C4TSEL                        129
#define C4TSEL0                       130
#define C4TSEL1                       131
#define C5TSEL                        132
#define C5TSEL0                       133
#define C5TSEL1                       134
#define CCPTMRS0                      135
#define C1TSEL0                       136
#define C1TSEL                        137
#define C1TSEL1                       138
#define C2TSEL0                       139
#define C2TSEL                        140
#define C2TSEL1                       141
#define C3TSEL0                       142
#define C3TSEL                        143
#define C3TSEL1                       144
#define T6CON                         145
#define T6CKPS0                       146
#define T6CKPS                        147
#define T6CKPS1                       148
#define TMR6ON                        149
#define T6OUTPS0                      150
#define T6OUTPS                       151
#define T6OUTPS1                      152
#define T6OUTPS2                      153
#define T6OUTPS3                      154
#define PR6                           155
#define TMR6                          156
#define T5GCON                        157
#define T5GSS                         158
#define T5GSS0                        159
#define T5GSS1                        160
#define T5GVAL                        161
#define T5G_DONE                      162
#define T5GGO_NOT_DONE                163
#define T5GGO_nDONE                   164
#define T5GGO                         165
#define T5GSPM                        166
#define T5GTM                         167
#define T5GPOL                        168
#define TMR5GE                        169
#define T5CON                         170
#define TMR5ON                        171
#define T5RD16                        172
#define RD165                         173
#define T5SYNC                        174
#define nT5SYNC                       175
#define NOT_T5SYNC                    176
#define SOSCEN5                       177
#define T5SOSCEN                      178
#define T5CKPS                        179
#define T5CKPS0                       180
#define T5CKPS1                       181
#define TMR5CS0                       182
#define TMR5CS                        183
#define TMR5CS1                       184
#define TMR5L                         185
#define TMR5H                         186
#define T4CON                         187
#define T4CKPS0                       188
#define T4CKPS                        189
#define T4CKPS1                       190
#define TMR4ON                        191
#define T4OUTPS                       192
#define T4OUTPS0                      193
#define T4OUTPS1                      194
#define T4OUTPS2                      195
#define T4OUTPS3                      196
#define PR4                           197
#define TMR4                          198
#define CCP5CON                       199
#define CCP5M0                        200
#define CCP5M                         201
#define CCP5M1                        202
#define CCP5M2                        203
#define CCP5M3                        204
#define DC5B0                         205
#define DC5B                          206
#define DC5B1                         207
#define CCPR5L                        208
#define CCPR5H                        209
#define CCP4CON                       210
#define CCP4M                         211
#define CCP4M0                        212
#define CCP4M1                        213
#define CCP4M2                        214
#define CCP4M3                        215
#define DC4B0                         216
#define DC4B                          217
#define DC4B1                         218
#define CCPR4L                        219
#define CCPR4H                        220
#define PSTR3CON                      221
#define STR3A                         222
#define STRA3                         223
#define STRB3                         224
#define STR3B                         225
#define STR3C                         226
#define STRC3                         227
#define STR3D                         228
#define STRD3                         229
#define STRSYNC3                      230
#define STR3SYNC                      231
#define ECCP3AS                       232
#define P3SSBD0                       233
#define PSS3BD0                       234
#define PSS3BD                        235
#define P3SSBD                        236
#define P3SSBD1                       237
#define PSS3BD1                       238
#define P3SSAC                        239
#define P3SSAC0                       240
#define PSS3AC0                       241
#define PSS3AC                        242
#define P3SSAC1                       243
#define PSS3AC1                       244
#define CCP3AS                        245
#define CCP3AS0                       246
#define CCP3AS1                       247
#define CCP3AS2                       248
#define CCP3ASE                       249
#define PWM3CON                       250
#define P3DC                          251
#define P3DC0                         252
#define P3DC1                         253
#define P3DC2                         254
#define P3DC3                         255
#define P3DC4                         256
#define P3DC5                         257
#define P3DC6                         258
#define P3RSEN                        259
#define CCP3CON                       260
#define CCP3M                         261
#define CCP3M0                        262
#define CCP3M1                        263
#define CCP3M2                        264
#define CCP3M3                        265
#define DC3B                          266
#define DC3B0                         267
#define DC3B1                         268
#define P3M                           269
#define P3M0                          270
#define P3M1                          271
#define CCPR3L                        272
#define CCPR3H                        273
#define SLRCON                        274
#define SLRA                          275
#define SLRB                          276
#define SLRC                          277
#define SLRD                          278
#define SLRE                          279
#define WPUB                          280
#define WPUB0                         281
#define WPUB1                         282
#define WPUB2                         283
#define WPUB3                         284
#define WPUB4                         285
#define WPUB5                         286
#define WPUB6                         287
#define WPUB7                         288
#define IOCB                          289
#define IOCB4                         290
#define IOCB5                         291
#define IOCB6                         292
#define IOCB7                         293
#define PSTR2CON                      294
#define STR2A                         295
#define P2DC02                        296
#define STRA2                         297
#define P2DC0CON                      298
#define STR2B                         299
#define P2DC1CON                      300
#define P2DC12                        301
#define STRB2                         302
#define STR2C                         303
#define STRC2                         304
#define P2DC22                        305
#define P2DC2CON                      306
#define P2DC32                        307
#define STR2D                         308
#define STRD2                         309
#define P2DC3CON                      310
#define P2DC42                        311
#define STR2SYNC                      312
#define P2DC4CON                      313
#define STRSYNC2                      314
#define ECCP2AS                       315
#define PSS2BD                        316
#define PSS2BD0                       317
#define P2SSBD                        318
#define P2SSBD0                       319
#define PSS2BD1                       320
#define P2SSBD1                       321
#define PSS2AC0                       322
#define P2SSAC                        323
#define P2SSAC0                       324
#define PSS2AC                        325
#define PSS2AC1                       326
#define P2SSAC1                       327
#define CCP2AS                        328
#define CCP2AS0                       329
#define CCP2AS1                       330
#define CCP2AS2                       331
#define CCP2ASE                       332
#define PWM2CON                       333
#define P2DC                          334
#define P2DC0                         335
#define P2DC1                         336
#define P2DC2                         337
#define P2DC3                         338
#define P2DC4                         339
#define P2DC5                         340
#define P2DC6                         341
#define P2RSEN                        342
#define CCP2CON                       343
#define CCP2M                         344
#define CCP2M0                        345
#define CCP2M1                        346
#define CCP2M2                        347
#define CCP2M3                        348
#define DC2B                          349
#define DC2B0                         350
#define DC2B1                         351
#define P2M                           352
#define P2M0                          353
#define P2M1                          354
#define CCPR2L                        355
#define CCPR2H                        356
#define SSP2CON3                      357
#define SSP2CON3_DHEN                 358
#define SSP2CON3_AHEN                 359
#define SSP2CON3_SBCDE                360
#define SSP2CON3_SDAHT                361
#define SSP2CON3_BOEN                 362
#define SSP2CON3_SCIE                 363
#define SSP2CON3_PCIE                 364
#define SSP2CON3_ACKTIM               365
#define SSP2MSK                       366
#define SSP2MSK_MSK0                  367
#define SSP2MSK_MSK1                  368
#define SSP2MSK_MSK2                  369
#define SSP2MSK_MSK3                  370
#define SSP2MSK_MSK4                  371
#define SSP2MSK_MSK5                  372
#define SSP2MSK_MSK6                  373
#define SSP2MSK_MSK7                  374
#define SSP2CON2                      375
#define SEN2                          376
#define SSP2CON2_SEN                  377
#define ADMSK12                       378
#define SSP2CON2_RSEN                 379
#define RSEN2                         380
#define ADMSK22                       381
#define PEN2                          382
#define SSP2CON2_PEN                  383
#define ADMSK32                       384
#define SSP2CON2_RCEN                 385
#define RCEN2                         386
#define ACKEN2                        387
#define ADMSK42                       388
#define SSP2CON2_ACKEN                389
#define ACKDT2                        390
#define ADMSK52                       391
#define SSP2CON2_ACKDT                392
#define SSP2CON2_ACKSTAT              393
#define ACKSTAT2                      394
#define GCEN2                         395
#define SSP2CON2_GCEN                 396
#define SSP2CON1                      397
#define SSP2CON1_SSPM                 398
#define SSP2CON1_SSPM0                399
#define SSPM02                        400
#define SSPM12                        401
#define SSP2CON1_SSPM1                402
#define SSP2CON1_SSPM2                403
#define SSPM22                        404
#define SSPM32                        405
#define SSP2CON1_SSPM3                406
#define SSP2CON1_CKP                  407
#define CKP2                          408
#define SSPEN2                        409
#define SSP2CON1_SSPEN                410
#define SSPOV2                        411
#define SSP2CON1_SSPOV                412
#define WCOL2                         413
#define SSP2CON1_WCOL                 414
#define SSP2STAT                      415
#define SSP2STAT_BF                   416
#define BF2                           417
#define SSP2STAT_UA                   418
#define UA2                           419
#define SSP2STAT_R_W                  420
#define RW2                           421
#define SSP2STAT_R                    422
#define READ_WRITE2                   423
#define nW2                           424
#define SSP2STAT_nW                   425
#define SSP2STAT_W                    426
#define SSP2STAT_nWRITE               427
#define I2C_READ2                     428
#define SSP2STAT_R_NOT_W              429
#define R_nW2                         430
#define nWRITE2                       431
#define R_W2                          432
#define SSP2STAT_R_nW                 433
#define SSP2STAT_NOT_WRITE            434
#define SSP2STAT_S                    435
#define S2                            436
#define START2                        437
#define I2C_START2                    438
#define SSP2STAT_P                    439
#define P2                            440
#define STOP2                         441
#define I2C_STOP2                     442
#define SSP2STAT_D                    443
#define SSP2STAT_A                    444
#define DA2                           445
#define DATA_ADDRESS2                 446
#define SSP2STAT_NOT_ADDRESS          447
#define SSP2STAT_D_NOT_A              448
#define D_A2                          449
#define SSP2STAT_D_nA                 450
#define SSP2STAT_nADDRESS             451
#define nA2                           452
#define I2C_DAT2                      453
#define nADDRESS2                     454
#define SSP2STAT_nA                   455
#define SSP2STAT_D_A                  456
#define D_nA2                         457
#define SSP2STAT_CKE                  458
#define CKE2                          459
#define SSP2STAT_SMP                  460
#define SMP2                          461
#define SSP2ADD                       462
#define MSK02                         463
#define SSP2ADD_SSPADD                464
#define MSK12                         465
#define MSK22                         466
#define MSK32                         467
#define MSK42                         468
#define MSK52                         469
#define MSK62                         470
#define MSK72                         471
#define SSP2BUF                       472
#define SSP2BUF_SSPBUF                473
#define BAUDCON2                      474
#define BAUDCON2_ABDEN                475
#define ABDEN2                        476
#define WUE2                          477
#define BAUDCON2_WUE                  478
#define BRG162                        479
#define BAUDCON2_BRG16                480
#define BAUDCON2_SCKP                 481
#define SCKP2                         482
#define BAUDCON2_CKTXP                483
#define TXCKP2                        484
#define DTRXP2                        485
#define RXDTP2                        486
#define BAUDCON2_DTRXP                487
#define RCMT2                         488
#define RCIDL2                        489
#define BAUDCON2_RCIDL                490
#define BAUDCON2_ABDOVF               491
#define ABDOVF2                       492
#define RCSTA2                        493
#define RCD82                         494
#define RX9D2                         495
#define RCSTA2_RX9D                   496
#define RCSTA2_OERR                   497
#define OERR2                         498
#define FERR2                         499
#define RCSTA2_FERR                   500
#define RCSTA2_ADEN                   501
#define ADDEN2                        502
#define RCSTA2_ADDEN                  503
#define RCSTA2_CREN                   504
#define CREN2                         505
#define SREN2                         506
#define RCSTA2_SREN                   507
#define RC92                          508
#define RC8_92                        509
#define RCSTA2_RX9                    510
#define RX92                          511
#define RCSTA2_SPEN                   512
#define SPEN2                         513
#define TXSTA2                        514
#define TX9D2                         515
#define TXSTA2_TX9D                   516
#define TXD82                         517
#define TRMT2                         518
#define TXSTA2_TRMT                   519
#define BRGH2                         520
#define TXSTA2_BRGH                   521
